Revit 2020 API
ExternalServices.BuiltInExternalServices Properties
The ExternalServices.BuiltInExternalServices type exposes the following members.
Properties
Name | Description
CloudExternalService
 The external service which supports get cloud model information from cloud servers such as C4R.
CodeCheckingParameterService
 The external service supporting view and modification of the structural code checking parameter in analytical elements. To use this service, programmers implement a server class that derives from ICodeCheckingParameterServer.
ConnectionTypeChangedService
 The external service used to notify when structural connection changed the type.
DirectContext3DService
 The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API. To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.
DuctFittingAndAccessoryPressureDropService
 The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.
DuctFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer.
DuctPressureDropService
 The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctPressureDropServer.
EntitlementExternalService
 The external service which supports get entitlement information.
ExternalResourceService
 The external service Id which permits registration of an alternate servers for managing external resources such as linked files.
ExternalResourceUIService
 The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
FramingProfileService
 The external service responsible for the generation of the fabrication profile.
HoleDefinitionService
 The external service to view and modify hole definition parameters.
IFCExporterService
 The external service which permits registration of an alternate implementation for IFC export.
IFCImporterService
 The external service which permits registration of an alternate implementation for IFC import.
MemberForcesService
 The external service supporting view and modification of the member forces in analytical elements. The service is still under development and cannot be used. It means that no server can be external registered from it yet.
ModifyConnectionParametersService
 The external service to view and modify structural connection parameters.
NavisworksExporterService
 The external service which supports export of the model to Navisworks.
PathOfTravelCalculationService
PipeFittingAndAccessoryPressureDropService
 The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer.
PipeFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
PipeFrictionFactorService
 Pipe friction factor service id
PipePlumbingFixtureFlowService
 The external service which permits registration of an alternate implementation for pipe fixture flow calculation. To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.
PipePressureDropService
 The external service which permits registration of an alternate implementation for pipe pressure drop calculation. To use this service, programmers implement a server class that derives from IPipePressureDropServer.
RebarUpdateService
SiteInsertService
 The external service which permits registration of an alternate implementation for Site insert.
SiteLinkerUIService
 The external UI service Id which permits registration of an alternate servers for new ui of link topography
SnappingService
StructuralSectionsService
 The external service supporting view and modification of the structural sections shape in structural elements. The service is still under development and cannot be used. It means that no server can be external registered from it yet.
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace